In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
dframe = DataFrame({'k1':['X','X','Y','Y','Z'],'k2':['alpha','beta','alpha','beta','alpha'],'dataset1':np.random.randn(5),'dataset2':np.random.randn(5)})

In [3]:
dframe

   dataset1  dataset2 k1     k2
0  0.279379 -0.171653  X  alpha
1  1.368663  1.332535  X   beta
2 -0.956936 -0.634001  Y  alpha
3 -0.132250 -1.742019  Y   beta
4  0.364663 -0.814554  Z  alpha

In [4]:
group1 = dframe['dataset1'].groupby(dframe['k1'])
group1

In [5]:
group1.mean()

k1
X    0.824021
Y   -0.544593
Z    0.364663
Name: dataset1, dtype: float64

In [6]:
cities = np.array(['NY','LA','LA','NY','NY'])
month = np.array(['JAN','FEB','JAN','FEB','JAN'])

In [8]:
dframe['dataset1'].groupby([cities,month]).mean()

LA  FEB    1.368663
    JAN   -0.956936
NY  FEB   -0.132250
    JAN    0.322021
Name: dataset1, dtype: float64

In [9]:
# 데이터셋에서 도시와 월을 묶은 것의 평균을 구한다...

In [10]:
dframe

   dataset1  dataset2 k1     k2
0  0.279379 -0.171653  X  alpha
1  1.368663  1.332535  X   beta
2 -0.956936 -0.634001  Y  alpha
3 -0.132250 -1.742019  Y   beta
4  0.364663 -0.814554  Z  alpha

In [11]:
dframe.groupby('k1').mean()

    dataset1  dataset2
k1
X   0.824021  0.580441
Y  -0.544593 -1.188010
Z   0.364663 -0.814554

In [12]:
dframe.groupby(['k1','k2']).mean()

          dataset1  dataset2
k1 k2
X  alpha  0.279379 -0.171653
   beta   1.368663  1.332535
Y  alpha -0.956936 -0.634001
   beta  -0.132250 -1.742019
Z  alpha  0.364663 -0.814554

In [13]:
dframe.groupby(['k1']).size()

k1
X    2
Y    2
Z    1
dtype: int64

In [42]:
for name, group in dframe.groupby('k1'):
    print ("This is the {} group".format(name))
    print (group)
    print ('\n')

This is the X group
   dataset1  dataset2 k1     k2
0  0.279379 -0.171653  X  alpha
1  1.368663  1.332535  X   beta


This is the Y group
   dataset1  dataset2 k1     k2
2 -0.956936 -0.634001  Y  alpha
3 -0.132250 -1.742019  Y   beta


This is the Z group
   dataset1  dataset2 k1     k2
4  0.364663 -0.814554  Z  alpha

In [40]:
# 2.x로 강의하고 나는 3.x여서 문법을 다르게 사용함.

In [43]:
for (k1,k2), group in dframe.groupby(['k1','k2']):
    print("key1 = {} key2 {}".format(k1,k2))
    print(group)
    print('\n')

key1 = X key2 alpha
   dataset1  dataset2 k1     k2
0  0.279379 -0.171653  X  alpha


key1 = X key2 beta
   dataset1  dataset2 k1    k2
1  1.368663  1.332535  X  beta


key1 = Y key2 alpha
   dataset1  dataset2 k1     k2
2 -0.956936 -0.634001  Y  alpha


key1 = Y key2 beta
   dataset1  dataset2 k1    k2
3  -0.13225 -1.742019  Y  beta


key1 = Z key2 alpha
   dataset1  dataset2 k1     k2
4  0.364663 -0.814554  Z  alpha

In [48]:
group_dict = dict(list(dframe.groupby('k1')))

In [49]:
group_dict['X']

   dataset1  dataset2 k1     k2
0  0.279379 -0.171653  X  alpha
1  1.368663  1.332535  X   beta

In [53]:
group_dict_axis1 = dict(list(dframe.groupby(dframe.dtypes,axis=1)))
group_dict_axis1

{dtype('float64'):    dataset1  dataset2
 0  0.279379 -0.171653
 1  1.368663  1.332535
 2 -0.956936 -0.634001
 3 -0.132250 -1.742019
 4  0.364663 -0.814554, dtype('O'):   k1     k2
 0  X  alpha
 1  X   beta
 2  Y  alpha
 3  Y   beta
 4  Z  alpha}

In [55]:
dataset2_group = dframe.groupby(['k1','k2'])[['dataset2']]
dataset2_group.mean()

          dataset2
k1 k2
X  alpha -0.171653
   beta   1.332535
Y  alpha -0.634001
   beta  -1.742019
Z  alpha -0.814554

In [44]:
dframe

   dataset1  dataset2 k1     k2
0  0.279379 -0.171653  X  alpha
1  1.368663  1.332535  X   beta
2 -0.956936 -0.634001  Y  alpha
3 -0.132250 -1.742019  Y   beta
4  0.364663 -0.814554  Z  alpha